In [1]:
import pandas as pd

In [7]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [8]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [9]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [12]:
# concat week1 and week2 dataframes
pd.concat(objs = [week1, week2]) # concats week2 at the end of week1 but maintains the same index
# pd.concat(objs = [week1, week2], ignore_index = False) # same as above
pd.concat(objs = [week1, week2], ignore_index = True) # Renumerates the index

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [13]:
week1.append(other = week2)

C:\Users\manuel.clemente\AppData\Local\Temp\ipykernel_1148\3624024427.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  week1.append(other = week2)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [15]:
import pandas as pd
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [20]:
# Create a multiindex dataframe to retain Week info and index
sales = pd.concat(objs = [week1, week2], keys = ["Week 1", "Week 2"]) # keys will be value in outermost label
sales.head(3)

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1

In [28]:
sales.loc[("Week 1", )]
sales.loc[("Week 2", )]

sales.loc[("Week 1", 240)]
sales.loc[("Week 2", 183)]

sales.loc[("Week 1", 240), "Customer ID"]
sales.loc[("Week 1", 240), ["Customer ID", "Food ID"]]

Customer ID    945
Food ID          5
Name: (Week 1, 240), dtype: int64

In [ ]:
# inner joins = combines 2 dataframes that have matching column - merge method
import pandas as pd
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [29]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [30]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [35]:
# merge common inner values based on Customer ID
week1.merge(week2, how = "inner", on = "Customer ID", suffixes = [" - Week 1", " - Week 2"])

    Customer ID  Food ID - Week 1  Food ID - Week 2
0           537                 9                 5
1           155                 9                 3
2           155                 1                 3
3           503                 5                 8
4           503                 5                 9
..          ...               ...               ...
57          945                 5                 4
58          343                 3                 5
59          343                 3                 2
60          343                 3                 7
61          621                 9                 6

[62 rows x 3 columns]

In [34]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [ ]:
# inner joins, part 2
import pandas as pd
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [37]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [38]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [39]:
# how => how to join the dataframes
# on = List of which columns to combine on
week1.merge(week2, how = "inner", on = ["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [43]:
 week1[week1["Customer ID"] == 578]

     Customer ID  Food ID
224          578        5

In [44]:
week2[week2["Customer ID"] == 578]

     Customer ID  Food ID
29           578        5
189          578        5